
/*
Добавить в существующий  массив элемент
Добавить существующий в элемент

Показать прямых потомков
Показать прямого предка

показать всех потомков на любом уровне
Показать всех предков

Удалить из него элемент
Удалить его из элемента


Является ли прямым потомком элемент
Является ли прямым потомком элемента

Является ли прямым предком элемент
Является ли прямым предком элемента

 Является ли потомком элемент
 Является ли  потомком элемента

 Является ли  предком элемент
 Является ли  предком элемента


 */
