//опрелделяет границы скрола -скролит   скрол только вертикальный

/// контейнер в каком контейнер со скролом какой сразу позициониру  шире родителя . при позиционировании берётся ширина родителя -ширина его скрола
 // или компонент вставляется шаблоном .....


// как ширина и высота и настройки вида скрола если он клонируется ?
//шаблон редактировать?  -в общей таблице стилей пренастраивается поскольку css грузить не будем а родитель есть при превом обращении поднимет в модуль если их тапм нет и будет с ними работать

