//опрелделяет границы скрола -скролит   скрол только вертикальный

/// контейнер в каком контейнер со скролом какой сразу позициониру  шире родителя . при позиционировании берётся ширина родителя -ширина его скрола
 // или компонент вставляется шаблоном .....


// как ширина и высота и настройки вида скрола если он клонируется ?
//шаблон редактировать?  -в общей таблице стилей пренастраивается поскольку css грузить не будем а родитель есть при превом обращении поднимет в модуль если их тапм нет и будет с ними работать

 //TODO a я ведь стили могу подписывать зменять ... т.е каждому экземпляру клона я могу назначить свой стиль

// настраивается -ширина , высота , шаблон внешний для него в диве релятив , див с абсолютом
// подготавливается несколько для вставки в дом элементов
// настройка его содержит будет ли скройлер , будут ли размеры изменяемыми , его ширина и высота

// возможно формирование его динамически ?