
// добавлять в слайдер слой сверху на время анимаций чтоб нельзя было ничего сделать
// откаты левые правые в зависимости от настроек

// модуль слайдера клонируется
// смена слайдов анимация -учесть тип по круги или линейно


 function getscrol(event){
     // закрыть весь экран -служебный див с бекграундом пикселом прозрачным

     // есть ли следующий -в круговой первый после анимации попадает в конец(проверка если он не конечный слева или справа в зависимости?

     // выпонить необходимую анимацию -лефт/топ с 0 совпадает либо не может принимать пол отр значение в зависимости от направления  -сровнять с нулём

     // снять окно

 }